-- 5、查询所有同学的学生编号、学生姓名、选课总数、所有课程的总成绩

SELECT a.s_id, a.s_name, b.* FROM
    student AS a LEFT JOIN score AS b ON a.s_id = b.s_id;

-- 终极SQL
SELECT a.s_id, a.s_name, count(b.c_id) AS sum_course, sum(b.s_score) AS sum_score FROM
    student AS a LEFT JOIN score AS b ON a.s_id = b.s_id
    GROUP BY a.s_id, a.s_name;

-- 查询结果
/*
+------+--------+------+------+---------+
| s_id | s_name | s_id | c_id | s_score |
+------+--------+------+------+---------+
| 01   | 赵雷   | 01   | 01   |      80 |
| 01   | 赵雷   | 01   | 02   |      90 |
| 01   | 赵雷   | 01   | 03   |      99 |
| 02   | 钱电   | 02   | 01   |      70 |
| 02   | 钱电   | 02   | 02   |      60 |
| 02   | 钱电   | 02   | 03   |      80 |
| 03   | 孙风   | 03   | 01   |      80 |
| 03   | 孙风   | 03   | 02   |      80 |
| 03   | 孙风   | 03   | 03   |      80 |
| 04   | 李云   | 04   | 01   |      50 |
| 04   | 李云   | 04   | 02   |      30 |
| 04   | 李云   | 04   | 03   |      20 |
| 05   | 周梅   | 05   | 01   |      76 |
| 05   | 周梅   | 05   | 02   |      87 |
| 06   | 吴兰   | 06   | 01   |      31 |
| 06   | 吴兰   | 06   | 03   |      34 |
| 07   | 郑竹   | 07   | 02   |      89 |
| 07   | 郑竹   | 07   | 03   |      98 |
| 08   | 王菊   | NULL | NULL |    NULL |
+------+--------+------+------+---------+
19 rows in set (0.00 sec)

+------+--------+------------+-----------+
| s_id | s_name | sum_course | sum_score |
+------+--------+------------+-----------+
| 01   | 赵雷   |          3 |       269 |
| 02   | 钱电   |          3 |       210 |
| 03   | 孙风   |          3 |       240 |
| 04   | 李云   |          3 |       100 |
| 05   | 周梅   |          2 |       163 |
| 06   | 吴兰   |          2 |        65 |
| 07   | 郑竹   |          2 |       187 |
| 08   | 王菊   |          0 |      NULL |
+------+--------+------------+-----------+
8 rows in set (0.01 sec)
*/