-- 9、查询学过编号为"01"并且也学过编号为"02"的课程的同学的信息

SELECT * FROM
    student WHERE s_id IN (
        SELECT s_id FROM 
            score WHERE c_id = '01' AND s_id IN (
                SELECT s_id FROM score WHERE c_id = '02'
            )
    );

-- 终极sql
SELECT a.* FROM 
    student a, score b, score c 
    WHERE a.s_id = b.s_id AND a.s_id = c.s_id AND b.c_id = '01' AND c.c_id = '02';

-- 查询结果
/*
+------+--------+------------+-------+
| s_id | s_name | s_birth    | s_sex |
+------+--------+------------+-------+
| 01   | 赵雷   | 1990-01-01 | 男    |
| 02   | 钱电   | 1990-12-21 | 男    |
| 03   | 孙风   | 1990-05-20 | 男    |
| 04   | 李云   | 1990-08-06 | 男    |
| 05   | 周梅   | 1991-12-01 | 女    |
+------+--------+------------+-------+
5 rows in set (0.01 sec)

+------+--------+------------+-------+
| s_id | s_name | s_birth    | s_sex |
+------+--------+------------+-------+
| 01   | 赵雷   | 1990-01-01 | 男    |
| 02   | 钱电   | 1990-12-21 | 男    |
| 03   | 孙风   | 1990-05-20 | 男    |
| 04   | 李云   | 1990-08-06 | 男    |
| 05   | 周梅   | 1991-12-01 | 女    |
+------+--------+------------+-------+
5 rows in set (0.00 sec)
*/