-- 29、查询名字中含有"风"字的学生信息

SELECT * FROM student WHERE s_name LIKE '%风%';

-- 终极sql
select * from student where s_name like '%风%';

/*
+------+--------+------------+-------+
| s_id | s_name | s_birth    | s_sex |
+------+--------+------------+-------+
| 03   | 孙风   | 1990-05-20 | 男    |
+------+--------+------------+-------+
1 row in set (0.00 sec)

+------+--------+------------+-------+
| s_id | s_name | s_birth    | s_sex |
+------+--------+------------+-------+
| 03   | 孙风   | 1990-05-20 | 男    |
+------+--------+------------+-------+
1 row in set (0.01 sec)
*/