-- 35、查询所有学生的课程及分数情况； 

SELECT a.s_id, a.s_name, b.s_score, c.c_id
    FROM student a JOIN score b ON a.s_id = b.s_id 
    JOIN course c ON c.c_id = b.c_id;

SELECT a.s_id, a.s_name, 
    SUM(case c.c_name WHEN '语文' THEN b.s_score ELSE 0 END) AS '语文',
    SUM(case c.c_name WHEN '数学' THEN b.s_score ELSE 0 END) AS '数学',
    SUM(case c.c_name WHEN '英语' THEN b.s_score ELSE 0 END) AS '英语',
    SUM(b.s_score) AS '总分' FROM student a JOIN score b 
    ON a.s_id = b.s_id JOIN course c ON b.c_id = c.c_id
    GROUP BY a.s_id, a.s_name;

-- 查询结果
/*
+------+--------+---------+------+
| s_id | s_name | s_score | c_id |
+------+--------+---------+------+
| 01   | 赵雷   |      80 | 01   |
| 01   | 赵雷   |      90 | 02   |
| 01   | 赵雷   |      99 | 03   |
| 02   | 钱电   |      70 | 01   |
| 02   | 钱电   |      60 | 02   |
| 02   | 钱电   |      80 | 03   |
| 03   | 孙风   |      80 | 01   |
| 03   | 孙风   |      80 | 02   |
| 03   | 孙风   |      80 | 03   |
| 04   | 李云   |      50 | 01   |
| 04   | 李云   |      30 | 02   |
| 04   | 李云   |      20 | 03   |
| 05   | 周梅   |      76 | 01   |
| 05   | 周梅   |      87 | 02   |
| 06   | 吴兰   |      31 | 01   |
| 06   | 吴兰   |      34 | 03   |
| 07   | 郑竹   |      89 | 02   |
| 07   | 郑竹   |      98 | 03   |
+------+--------+---------+------+
18 rows in set (0.00 sec)

+------+--------+--------+--------+--------+--------+
| s_id | s_name | 语文   | 数学   | 英语   | 总分   |
+------+--------+--------+--------+--------+--------+
| 01   | 赵雷   |     80 |     90 |     99 |    269 |
| 02   | 钱电   |     70 |     60 |     80 |    210 |
| 03   | 孙风   |     80 |     80 |     80 |    240 |
| 04   | 李云   |     50 |     30 |     20 |    100 |
| 05   | 周梅   |     76 |     87 |      0 |    163 |
| 06   | 吴兰   |     31 |      0 |     34 |     65 |
| 07   | 郑竹   |      0 |     89 |     98 |    187 |
+------+--------+--------+--------+--------+--------+
7 rows in set (0.00 sec)
*/